#!/bin/bash

									Shell特殊扩展变量说明(判断变量是否赋值后的处理方式)
 ------------------------------------------------------------------------------------------------------------------------------
 	表达式					 说明								示例						示例说明
 ------------------------------------------------------------------------------------------------------------------------------
 ${parameter:-word}	如果parameter的变量值为空或未赋值,									
					则会返回word字符串并替代变量的值		echo $test1					执行完后result1的值为"UNSET",
					用途:如果变量未定义,则返回备用的值,		result1=${test1:-UNSET}		test1还是为空
					防止变量为空值或因未定义而异常			
 ------------------------------------------------------------------------------------------------------------------------------
 ${parameter:=word}	如果parameter的变量值为空或未赋值,		
					则设置这个变量值为word,并返回其值		
					位置变量和特殊变量不适用				echo $test2					执行完后result2与test2的
 					用途:基本同上${parameter:-word},		result2=${test2:=UNSET}		值都为"UNSET"
 					但是该变量又额外给parameter赋值了
 ------------------------------------------------------------------------------------------------------------------------------
 ${parameter:?word}	如果parameter的变量值为空或未赋值,		echo $test3					 此时会以"not defin"为
					那么word字符串将作为标准错误输出		result3=${test3:?not defin}	 提示错误提示信息退出
					否则输出变量的值
					用途:用于捕捉由于变量未定义而导致的
					错误m并退出程序
 ------------------------------------------------------------------------------------------------------------------------------
 ${parameter:+word}	若parameter的变量值为空或未赋值则		echo $test4					在test4未定义时result4值为空
					什么什么都不做,若parameter变量值不		result4=${test4:+Liudl}
					为空则将word字符串将代替变量的值		
														test4="Liuhy"				在test4定义之后行完毕后test4值为"Liuhy"
														result4=${test4:+Liudl}		result4值为"Liudl"
 ------------------------------------------------------------------------------------------------------------------------------



