
1.shell变量的特性
<1>默认情况下,bash shell中是不会区分变量类型的
<2>若需要指定变量的类型,可以使用declare显示定义变量的类型
<3>Shell开发者在开发脚本时需要自行注意shell脚本中的变量类型

#-----------------------------------------------------------------------
2.变量类型
<1>环境变量(全局变量)
 a.可以创建在它们Shell及其派生出来的任意子进程shell中使用
 b.又可分为自定义环境变量和bash内置的环境变量 
 
<2>普通变量(局部变量)
 a.只能在创建他们的shell函数或shell脚本中使用
 b.一般由开发者在开发脚本时创建

#-----------------------------------------------------------------------
3.查看变量
<1>env (只显示全局变量)
<2>set -o (显示所有参数配置信息)
<3>declare (输出所有的变量函数整数和已经导出的变量)

#-----------------------------------------------------------------------
4.自定义环境变量(三种方式)
<1>export MYNAME=ldl
<2>declare -x  MYNAME=ldl
<3>MYNAME=ldl;export MYNAME

#-----------------------------------------------------------------------
5.消除本地变量和环境变量
<1>unset  MYNAME

#-----------------------------------------------------------------------
6.普通变量的定义
<1>myname =12345(不加任何引号直接定义)
 a.当内容为简单连续的数字,字符串,路径名时可以这样用
 b.值里有变量时会被解析后再输出
 
<2>myname ='12345'(带单引号)
 a.输出变量内容时单引号里是什么就输出什么
 b.即使内容中有变量和命令也会原样输出
 
<3>myname ="12345"(带双引号)
 a.输出变量内容时引号里的变量及命令会经过解析后再输出
 b.比较适合于字符串中附带有变量及命令且想将其解析后再输出的变量定义
 
<4>局部变量函数中的变量可以使用local方式进行定义,防止函数中的变量与外部程序中的变量相同引起异常
 如:local i

#-----------------------------------------------------------------------
7.把一个命令的结果作为变量的内容赋值的方法(2种)
<1>变量名 =`ls` (用反引号,不推荐使用,容易与单引号混淆)
<2>变量名 =$(ls) (把命令用$()括起来,推荐使用)

#-----------------------------------------------------------------------
8.变量定义技巧总结
<1>变量名只能为字母,数字或下划线,只能以字母或下划线开头
<2>一般的变量定义,赋值常用双引号;简单连续的字符串可以不加引号;希望原样输出时使用单引号
<3>希望变量的内容是命令的解析结果时,要用反引号``,或者用$()把命令括起来再赋值
<4>打印输出或使用变量时,变量名前要接$符号
<5>变量名后面紧接其他字符的时候要用大括号将变量部分单独括起来

#-----------------------------------------------------------------------
9.环境变量
-根据规范所有环境变量的名字均采用大写形式
-一般指用export内置命令导出的变量所有环境变量都是系统全局变量可用于所有子进程编辑器各类应用
-通常环境变量被定义在用户目录的.bash_profile文件或全局配置文件/etc/profile中
-部分bash环境变量展示

	变量名									含义
------------------------------------------------------------------------
 _=									 上一条命令的最后一个参数
------------------------------------------------------------------------
 BASH=/bin/bash						 调用bash实例时使用的全路径名 
------------------------------------------------------------------------
 BASH_VERSINFO=([0]="3"[1]="2"
 [2]="25"[3]="1"[4]="release"		 bash版本信息
 [5]="x86_64-redhat-linux-gnu")
------------------------------------------------------------------------
 BASH_VERSION='3.2.25(1)-release'	 当前bash实例的版本号
------------------------------------------------------------------------
 COLORS=/etc/DIR_COLOES				 颜色变量
------------------------------------------------------------------------
 COLUMNS=132						 给shell编辑模式和选择的命令定义了编辑窗口的宽度
------------------------------------------------------------------------
 DIRSTACK=()						 代表目录栈的当前内容
------------------------------------------------------------------------
 EUID=0								 在shell启动时被初始化的当前用户有效ID
------------------------------------------------------------------------
 GROUPS=()							 当前用户所属的组
------------------------------------------------------------------------
 HISTFILE=/root/.bash_history		 历史记录文件的全路径
------------------------------------------------------------------------
 HISTFILESIZE=50					 历史文件能包含的最大行数
------------------------------------------------------------------------
 HISTSIZE=50						 记录命令行历史文件中的命令行数
------------------------------------------------------------------------
 HOME=/root							 当前用户家目录
------------------------------------------------------------------------
 HOSTNAME=LDL						 当前主机名称
------------------------------------------------------------------------
 HOSTTYPE=x86_64					 当前操作系统类型
------------------------------------------------------------------------
 IFS=$'\t\n'						 内部字段分隔符,一般是空格,制表符和换行符
									 用于划分由命令替换,循环结构中的表和所读
									 取的输入产生的词的字段
------------------------------------------------------------------------
 INPUTRC=/etc/inputrc				 readline启动文件的文件名,取代默认的~/.imputrc
------------------------------------------------------------------------
 JAVA_HOME=/application/jdk1.6.0_10  JAVA HOME环境变量
------------------------------------------------------------------------
 LANG=zh_CN.UTF-8					 字符集
------------------------------------------------------------------------
 LOGNAME=root						 登录用户名
------------------------------------------------------------------------
 MACHTYPE=x86_64-redhat-linux-gnu	 包含一个正在运行bash的系统串
------------------------------------------------------------------------
 MAILCHECK=60						 定义shell将隔多长时间(秒)检查一次由
									 参数MAILPATH或MAILFILE指定的文件查
									 看是否有邮件到达.默认为600S
------------------------------------------------------------------------
 MAIL=/var/spool/mail/root	 		 y邮件全路径
------------------------------------------------------------------------
 OLDPWD=/root						 前一个当前工作目录
------------------------------------------------------------------------
 OPTIND=1							 下一个由getopts内置命令处理的参数的序号
------------------------------------------------------------------------
 OSTYPE=linux-gnu					 自动设置成一个串,描述正在运行的bash
									 的操作系统默认值由操作系统来决定
------------------------------------------------------------------------
 PATH=/usr/lib64/qt-3.3/bin:
 /usr/kerberos/sbin:
 /usr/kerberos/bin					
 :/usr/local/sbin:/usr/local/bin:	 全局PATH路径,命令搜索路径
 /sbin:/bin:/usr/sbin:
 /usr/bin:/bin:
 /server/script/shangxian:
 /root/bin
------------------------------------------------------------------------
 PIPESTATUS=([0]="0"[1]="0")		 一个数组,包含一列最近在管道执行的
									 前台作业的进程退出的状态值
------------------------------------------------------------------------
 PPID=1112							 父进程的进程ID
------------------------------------------------------------------------
 PS1='[\u@\h\w]\$'					 主提示符串,默认值是$
------------------------------------------------------------------------
 PS2='>'							 次提示符串,默认值是>
------------------------------------------------------------------------
 PS4=`+`							 当开启追踪时使用的是调试提示符串,默认
									 +,追踪可用set -x开启
------------------------------------------------------------------------
 PWD=/home							 当前用户家目录
------------------------------------------------------------------------
 RESIN_HOME=/application/resin-3.1.6 通过export人为设置的环境变量,java环境会用
------------------------------------------------------------------------
 SHELL=/bin/bash					 登录Shell类型
------------------------------------------------------------------------
 SHELLOPTS=braceexpand:emacs:
 hashall:histexpand:history:		 包含一列开启的shell选项	 
 interactive-comments:monitor
------------------------------------------------------------------------
 SHLVL=1							 每启动一个bash实例就将其加1
------------------------------------------------------------------------
 TERM=vt100							 设置终端
------------------------------------------------------------------------
 TMOUT=3600							 退出前等待超时的秒数
------------------------------------------------------------------------
 UID=0								 当前用户的UID,在shell启动时初始化
------------------------------------------------------------------------
 USER=root   						 当前用户的用户名,在shell启动时初始化
------------------------------------------------------------------------






 


























