#!/bin/bash
:<<eof
# 											Shell变量子串介绍(变量取值-测长-截取-删除-匹配)
# ----------------------------------------------------------------------------------------------------------------------
#	表达式									说明										示例
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter}					返回变量$parameter的内容				FANAME="liudiANDliudon"
#																		echo "faname = $FANAME"
# ----------------------------------------------------------------------------------------------------------------------
#	${#parameter}					返回变量$parameter的字符长度			echo "FANAME len ${#FANAME}"				
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter:offset}				在变量${parameter}中,从位置			echo "FANAME offset 7 str= ${FANAME:7}"
#									offset之后开始提取子串到结尾
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter:offset:length}		在变量${parameter}中,从位置			echo "FANAME offset 10-8 str= ${FANAME:10:8}"
#									offset之后开始取长度为
#									length的子串
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter#word}				从变量${parameter}开头开始			echo "FANAME del start-short = ${FANAME#l*u}"
#									删除最短匹配的word子串
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter##word}				从变量${parameter}开头开始			echo "FANAME del start-long = ${FANAME##l*u}"
#									删除最长匹配的word子串
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter%word}				从变量${parameter}结尾开始			echo "FANAME del end-short = ${FANAME%u*n}"
#									删除最短匹配的word子串
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter%%word}				从变量${parameter}结尾开始			echo "FANAME del end-long = ${FANAME%%u*n}"
#									删除最长匹配的word子串
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter/pattern/string}		使用string代替第一个匹配的				teststr="I am oldboy,yes,oldboy,no,oldboy"
#									pattern								echo "${teststr/oldboy/oldgirl}"
# ----------------------------------------------------------------------------------------------------------------------
#	${parameter//pattern/string}	使用string代替所有匹配的				echo "${teststr//oldboy/oldgirl}"
#									pattern
# ----------------------------------------------------------------------------------------------------------------------

eof





